# IsValidBoundaryOnSketchPlane Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryValidation..::..IsValidBoundaryOnSketchPlane Method
BoundaryValidation Class See Also
---
Indicates if the given curve loops compose a valid boundary on the sketch plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public static bool IsValidBoundaryOnSketchPlane(
	SketchPlane sketchPlane,
	IList<CurveLoop> curveLoops
)
```

Visual Basic
---
```text
Public Shared Function IsValidBoundaryOnSketchPlane ( _
	sketchPlane As SketchPlane, _
	curveLoops As IList(Of CurveLoop) _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidBoundaryOnSketchPlane(
	SketchPlane^ sketchPlane,
	IList<CurveLoop^>^ curveLoops
)
```

# ### Parameters
sketchPlane
    Type: Autodesk.Revit.DB..::..SketchPlane The sketch plane.
curveLoops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)> The curve loops to be checked.
# ### Return Value
True if the given curve loops are valid as described above, false otherwise.
# Remarks
The curve loops are valid if projections of the loops onto the sketch plane do not intersect each other; each curve loop is closed; input curves do not contain any helical curve; and each loop is planar and lies on a plane parallel to the sketch plane, but not necessarily the same plane.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BoundaryValidation Class
Autodesk.Revit.DB Namespace